demo-output/website/campaign/F3_runs/wedge/M2.0_th15/coarse/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2606                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

6
(
    inlet
    {
        type            patch;
        nFaces          20;
        startFace       3490;
    }
    outlet
    {
        type            patch;
        nFaces          20;
        startFace       3510;
    }
    bottom
    {
        type            symmetryPlane;
        inGroups        1(symmetryPlane);
        nFaces          30;
        startFace       3530;
    }
    top
    {
        type            patch;
        nFaces          90;
        startFace       3560;
    }
    obstacle
    {
        type            wall;
        inGroups        1(wall);
        nFaces          60;
        startFace       3650;
    }
    defaultFaces
    {
        type            empty;
        inGroups        1(empty);
        nFaces          3600;
        startFace       3710;
    }
)

// ************************************************************************* //
